app/views/users/show.html.erb

        <span class="text-zinc-400 text-sm">Projects created</span>
        <span class="text-white text-lg font-semibold"><%= @user.projects.count %></span>
---
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 10]]