app/views/projects/index.html.erb

                  </svg>
                  <%= pluralize(project.code_files.count, "file") %>
---
SELECT COUNT(*) FROM "code_files" WHERE "code_files"."project_id" = $1  [["project_id", 1]]