app/views/projects/show.html.erb

                </svg>
                <%= pluralize(@project.code_files.count, "file") %>
---
SELECT "code_files".* FROM "code_files" WHERE "code_files"."project_id" = $1 ORDER BY "code_files"."created_at" DESC  [["project_id", 1]]
SELECT COUNT(*) FROM "code_files" WHERE "code_files"."project_id" = $1  [["project_id", 1]]

      <h2 class="text-white font-semibold text-lg">Code Files</h2>
      <span class="text-xs text-zinc-600 bg-white/5 border border-white/10 rounded-full px-2.5 py-1"><%= @project.code_files.count %></span>
---
SELECT COUNT(*) FROM "code_files" WHERE "code_files"."project_id" = $1  [["project_id", 1]]


    <% if @project.code_files.any? %>
---
SELECT 1 AS one FROM "code_files" WHERE "code_files"."project_id" = $1 LIMIT $2  [["project_id", 1], ["LIMIT", 1]]

          <tbody class="divide-y divide-white/[0.04]">
            <% @project.code_files.order(created_at: :desc).each do |code_file| %>
---
SELECT "code_files".* FROM "code_files" WHERE "code_files"."project_id" = $1 ORDER BY "code_files"."created_at" DESC  [["project_id", 1]]