app/views/code_files/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = $1 ORDER BY "comments"."created_at" ASC  [["review_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."review_id" = $1  [["review_id", 1]]
---
        <h2 class="text-white font-semibold">Comments</h2>
        <span class="ml-auto text-xs text-zinc-600 bg-white/5 border border-white/10 rounded-full px-2.5 py-1"><%= last_review&.comments&.count || 0 %></span>

SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = $1 ORDER BY "comments"."created_at" ASC  [["review_id", 1]]
---
      <div id="comments" class="divide-y divide-white/[0.04]">
        <%= render last_review.comments.order(created_at: :asc) if last_review %>

SELECT 1 AS one FROM "comments" WHERE "comments"."review_id" = $1 LIMIT $2  [["review_id", 1], ["LIMIT", 1]]
---

      <% if last_review.nil? || last_review.comments.empty? %>