app/controllers/code_files_controller.rb

  def create
    @code_file = @project.code_files.build(code_file_params)
    authorize @code_file
    if @code_file.save
---
INSERT INTO "code_files" ("content", "language", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def set_project
    if params[:project_id]
      @project = current_user.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 10], ["id", 10], ["LIMIT", 1]]

  def set_code_file
    @code_file = CodeFile.find(params[:id])
---
SELECT "code_files".* FROM "code_files" WHERE "code_files"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]