app/controllers/projects_controller.rb

  def index
    @projects = Rails.cache.fetch("projects_user_#{current_user.id}", expires_in: 12.hours) do
      current_user.projects.to_a
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]

  def create
    @project = current_user.projects.build(project_params)
    authorize @project

    if @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def set_project
    @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 10], ["id", 10], ["LIMIT", 1]]