app/controllers/reviews_controller.rb

  def set_project
    @project = current_user.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]