app/controllers/reviews_controller.rb

SELECT "code_files".* FROM "code_files" WHERE "code_files"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 4]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."code_file_id" = $1  [["code_file_id", 18]]
INSERT INTO "reviews" ("status", "result", "summary", "code_file_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    code_file = CodeFile.find(params[:code_file_id])
    review = code_file.build_review
    authorize review

    Review.where(code_file_id: code_file.id).destroy_all

    result = AiReviewService.new(code_file).analyze

    review = Review.new(
      code_file_id: code_file.id,
      result: result.issues.to_json,
      summary: result.summary,
      status: "completed"
    )
    review.save!

SELECT "code_files".* FROM "code_files" WHERE "code_files"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_code_file
    @code_file = CodeFile.find(params[:code_file_id])