app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2026-07-29 08:57:43.244132"], ["id", 10]]
---
  def update
    @user = current_user

    if @user.update(user_params)