app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2026-07-29 08:57:43.244132"], ["id", 10]]